---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityStyle
source: html/cd78307b-a3f8-0a6d-b95b-1fc62b7f9645.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityStyle Property

"Style Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ImportAdtEntityStyle { get; }
```